load-test/load1.yaml
config:
  # proxy
  target: ws://localhost:8090/api/v1/chat/ws
  phases:
    - duration: 10
      arrivalRate: 5
      name: warm up
    - duration: 200
      arrivalRate: 200
      name: load
  ws:
    headers:
      Authorization: "Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJhY2Nlc3NfdXVpZCI6IjBmNDA1MzFiLWI3YjMtNGY0MC1iZTYwLTAzNzE0M2M3MzA2ZiIsImF1dGhvcml6ZWQiOnRydWUsImV4cCI6MjIxNzcwNTUzNCwicm9sZSI6InVzZXIiLCJ1c2VyX2lkIjoiNjA2YTAwODUxMTBkYmFiNzc1ZTNjODQyIn0.R8YGb_WRV5cLPB3wxSeae8liiDtNFRWCls5puhYuGuc"

scenarios:
  - name: test chatting
    engine: ws
    flow:
      - loop:
        - send:
            type: CHAT
            payload:
              messageId: "605259e826dcb9e43396db05"
              timestamp: "2021-03-18T02:35:04.005382742+07:00"
              roomId: "606a021826dcb9dde6612d76"
              userId: "5fef73eb315e73be2c81c745"
              uid: "TODO"
              data: "hello world"
              type: "TEXT"
        - think: 0.1
        count: 40